michal915/ADC_Atmega2560/ADC_mega_bez/HD44780/HD44780.h
//-------------------------------------------------------------------------------------------------
// Wywietlacz alfanumeryczny ze sterownikiem HD44780
// Sterowanie w trybie 4-bitowym bez odczytu flagi zajêtoci
// z dowolnym przypisaniem sygna³ów steruj¹cych
// Plik : HD44780.h
// Mikrokontroler : Atmel AVR
// Kompilator : avr-gcc
// Autor : Rados³aw Kwiecieñ
// ród³o : http://radzio.dxp.pl/hd44780/
// Data : 24.03.2007
//-------------------------------------------------------------------------------------------------


#include <avr/io.h>
#include <avr/iom2560.h>
#include <util/delay.h>


//-------------------------------------------------------------------------------------------------
//
// Konfiguracja sygna³ów steruj¹cych wywietlaczem.
// Mo¿na zmieniæ stosownie do potrzeb.
//
//-------------------------------------------------------------------------------------------------
/*
 * LCD RS pin to digital pin 12 - PPB6
 * LCD Enable pin to digital pin 11 - PB5
 * LCD D4 pin to digital pin 5 - PE3
 * LCD D5 pin to digital pin 4 - PG5
 * LCD D6 pin to digital pin 3 - PE5
 * LCD D7 pin to digital pin 2 - PE4
 * LCD R/W pin to ground
*/

#define LCD_RS_DIR		DDRB
#define LCD_RS_PORT 	PORTB
#define LCD_RS_PIN		PINB
#define LCD_RS			(1 << PB6)

#define LCD_RW_DIR		DDRB
#define LCD_RW_PORT		PORTB
#define LCD_RW_PIN		PINB
#define LCD_RW			(1 << PB1)

#define LCD_E_DIR		DDRB
#define LCD_E_PORT		PORTB
#define LCD_E_PIN		PINB
#define LCD_E			(1 << PB5)

#define LCD_DB4_DIR		DDRE
#define LCD_DB4_PORT	PORTE
#define LCD_DB4_PIN		PINE
#define LCD_DB4			(1 << PE3)

#define LCD_DB5_DIR		DDRG
#define LCD_DB5_PORT	PORTG
#define LCD_DB5_PIN		PING
#define LCD_DB5			(1 << PG5)

#define LCD_DB6_DIR		DDRE
#define LCD_DB6_PORT	PORTE
#define LCD_DB6_PIN		PINE
#define LCD_DB6			(1 << PE5)

#define LCD_DB7_DIR		DDRE
#define LCD_DB7_PORT	PORTE
#define LCD_DB7_PIN		PINE
#define LCD_DB7			(1 << PE4)




//-------------------------------------------------------------------------------------------------
//
// Instrukcje kontrolera Hitachi HD44780
//
//-------------------------------------------------------------------------------------------------

#define HD44780_CLEAR					0x01

#define HD44780_HOME					0x02

#define HD44780_ENTRY_MODE				0x04
	#define HD44780_EM_SHIFT_CURSOR		0
	#define HD44780_EM_SHIFT_DISPLAY	1
	#define HD44780_EM_DECREMENT		0
	#define HD44780_EM_INCREMENT		2

#define HD44780_DISPLAY_ONOFF			0x08
	#define HD44780_DISPLAY_OFF			0
	#define HD44780_DISPLAY_ON			4
	#define HD44780_CURSOR_OFF			0
	#define HD44780_CURSOR_ON			2
	#define HD44780_CURSOR_NOBLINK		0
	#define HD44780_CURSOR_BLINK		1

#define HD44780_DISPLAY_CURSOR_SHIFT	0x10
	#define HD44780_SHIFT_CURSOR		0
	#define HD44780_SHIFT_DISPLAY		8
	#define HD44780_SHIFT_LEFT			0
	#define HD44780_SHIFT_RIGHT			4

#define HD44780_FUNCTION_SET			0x20
	#define HD44780_FONT5x7				0
	#define HD44780_FONT5x10			4
	#define HD44780_ONE_LINE			0
	#define HD44780_TWO_LINE			8
	#define HD44780_4_BIT				0
	#define HD44780_8_BIT				16

#define HD44780_CGRAM_SET				0x40

#define HD44780_DDRAM_SET				0x80

//-------------------------------------------------------------------------------------------------
//
// Deklaracje funkcji
//
//-------------------------------------------------------------------------------------------------

void LCD_WriteCommand(unsigned char);
unsigned char LCD_ReadStatus(void);
void LCD_WriteData(unsigned char);
unsigned char LCD_ReadData(void);
void LCD_WriteText(char *);
void LCD_GoTo(unsigned char, unsigned char);
void LCD_Clear(void);
void LCD_Home(void);
void LCD_Initalize(void);
void LCD_ProgrammChar(unsigned char nr, unsigned char znak[]);
uint8_t LCD_Lightness(uint8_t i);

//-------------------------------------------------------------------------------------------------
//
// Koniec pliku HD44780.h
//
//-------------------------------------------------------------------------------------------------
